import numpy as np


#  Выполните программу обучения нейронной сети, приведенную в теме 4.1 на стр. 2-3

def nonlin(x, deriv=False):
    if deriv == True:
        return x * (1 - x)
    return 1 / (1 + np.exp(-x))


X = np.array([[0, 0, 1],
              [0, 1, 1],
              [1, 0, 1],
              [1, 1, 1]])
y = np.array([[0, 0, 1, 1]]).T
np.random.seed(1)
syn0 = 2 * np.random.random((3, 1)) - 1
for iter in range(60000):
    l0 = X
    l1 = nonlin(np.dot(l0, syn0))
    l1_error = y - l1
    l1_delta = l1_error * nonlin(l1, True)
    if iter == 0:
        print("l1 после первой итерации : ", "\n", l1)
        print("l1_error после первой итерации : ", "\n", l1_error)
    if iter == 59999:
        print("l1 после последней итерации : ", "\n", l1)
        print("l1_error после последней итерации : ", "\n", l1_error)
    syn0 += np.dot(l0.T, l1_delta)

#  сравните l1 после первой итерации и после последней
#  посмотрите, как меняется l1_error
'''
После последней итерации результаты гораздо ближе к 0 0 1 1, 
чем после первой, а ощибка l1_error знаительно меньше 

l1 после первой итерации :  
 [[0.2689864 ][0.36375058][0.23762817][0.3262757 ]]
l1_error после первой итерации :  
 [[-0.2689864 ][-0.36375058][ 0.76237183][ 0.6737243 ]]
 
l1 после последней итерации :  
 [[0.00390234][0.00318168][0.99740397][0.99681554]]
l1_error после последней итерации :  
 [[-0.00390234][-0.00318168][ 0.00259603][ 0.00318446]]
'''
