#  a) Во второй элемент кортежа (1, [2, 3]) добавьте еще один элемент: 4.

my_tuple_1 = (1, [2, 3])
my_tuple_1[1].append(4)
print("Во второй элемент кортежа (1, [2, 3]) добавьте еще один элемент: 4 : ", my_tuple_1)

#  b) К кортежу (1, [2, 3]) добавьте список из трех элементов.

my_tuple_2 = (1, [2, 3])
my_tuple_2 = list(my_tuple_2)
my_tuple_2.append([4, 5, 6])
my_tuple_2 = tuple(my_tuple_2)
print("К кортежу (1, [2, 3]) добавьте список из трех элементов : ", my_tuple_2)

#  c) К кортежу (1, [2, 3]) добавьте еще один элемент: строку.

my_tuple_3 = (1, [2, 3])
my_tuple_3 = list(my_tuple_3)
my_tuple_3.append("Hello world !")
my_tuple_3 = tuple(my_tuple_3)
print("К кортежу (1, [2, 3]) добавьте еще один элемент: строку : ", my_tuple_3)

#  d) Во втором элементе кортежа (1, [2, 3]) повторите еще раз имеющийся список.

my_tuple_4 = (1, [2, 3])
my_tuple_4 = list(my_tuple_4)
my_tuple_4[1].extend(my_tuple_4[1])
my_tuple_4 = tuple(my_tuple_4)
print("Во втором элементе кортежа (1, [2, 3]) повторите еще раз имеющийся список : ", my_tuple_4)
